{"config": [{"config": {"recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "stateful": false, "batch_input_shape": [null, 60, 1], "dtype": "float32", "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "return_sequences": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "units": 50, "implementation": 1, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "stateful": false, "unroll": false, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "return_sequences": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "units": 50, "implementation": 1, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "stateful": false, "unroll": false, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "name": "lstm_3", "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "return_sequences": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "units": 50, "implementation": 1, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "stateful": false, "unroll": false, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "name": "lstm_4", "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "return_sequences": false, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "units": 50, "implementation": 1, "unit_forget_bias": true, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "use_bias": true, "name": "dense_1", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}